[{"image":"afghanistan.png","answer1":"Afghanistan","answer2":"Mexique","answer3":"Rwanda","comment":"La couleur noire est la couleur associé au XIXe, lorsque le pays était indépendant. Le rouge symboliserait la lutte pour l'indépendance et le vert sa réussite finale."},{"image":"afriquedusud.png","answer1":"Afrique du Sud","answer2":"Pakistan","answer3":"Mozambique","comment":"Ce drapeau marque la fin de la symbolique blanche en Afrique du Sud et l'avènement d'une Afrique du Sud mélangée."},{"image":"algerie.png","answer1":"Algérie","answer2":"Russie","answer3":"Libye","comment":"Ce drapeau tire son origine des milieux nationalistes messalistes de la première moitié du XXe siècle."},{"image":"allemagne.png","answer1":"Allemagne","answer2":"Bahreïn","answer3":"Émirats Arabes Unis","comment":"Les couleurs du drapeau sont associées à la démocratie républicaine née après la Seconde Guerre mondiale, et représentent l'unité allemande et la liberté."},{"image":"arabiesaoudite.png","answer1":"Arabie saoudite","answer2":"Angola","answer3":"Lettonie","comment":"Le fond vert est la couleur de l'islam. Le drapeau porte, en blanc, un sabre (symbole de justice) et la chahada, la profession de foi musulmane."},{"image":"argentine.png","answer1":"Argentine","answer2":"Australie","answer3":"Uruguay","comment":"Il a été créé en 1812 par l'intellectuel devenu général Manuel Belgrano quand il regarda le soleil devant les côtes du Paraná, depuis la ville de Rosario."},{"image":"australie.png","answer1":"Australie","answer2":"Sri Lanka","answer3":"Paraguay","comment":"Dans le quart du dessous se trouve l'Étoile de la fédération, une étoile blanche à sept branches, six branches pour chacun des six États."},{"image":"autriche.png","answer1":"Autriche","answer2":"Mozambique","answer3":"Haïti","comment":"L'origine semble être l'utilisation comme bannière de la chemise ou de la tunique tachée de sang, et protégée par la ceinture, du duc de Babenberg lors d'une bataille contre les Maures."},{"image":"belgique.png","answer1":"Belgique","answer2":"Turkménistan","answer3":"Afghanistan","comment":"L'article 193 de la Constitution mentionne les couleurs : « La Nation belge adopte les couleurs rouge, jaune et noire, et pour armes le Lion du Royaume de Belgique »."},{"image":"bielorussie.png","answer1":"Biélorussie","answer2":"Mauritanie","answer3":"Costa Rica","comment":"La couleur rouge symbolise le sang versée par les défenseurs de la Biélorussie, et la couleur verte représente les forêts du pays."},{"image":"bolivie.png","answer1":"Bolivie","answer2":"Portugal","answer3":"Japon","comment":"Le rouge représente le sang perdu par les combattants protégeant le pays, le jaune pour la richesse minérale, le vert représente la richesse de l'environnement naturel."},{"image":"bresil.png","answer1":"Brésil","answer2":"Turkménistan","answer3":"État de Palestine","comment":"Le vert pour la forêt amazonienne, et le jaune (or) pour les ressources du sous-sol, le globe central avec au centre la Croix du Sud, symbole chrétien et symbole de l'hémisphère austral."},{"image":"bulgarie.png","answer1":"Bulgarie","answer2":"Norvège","answer3":"Turkménistan","comment":"Le blanc symbolise la paix, le vert la fertilité des terres bulgares et le rouge le courage du peuple."},{"image":"camroun.png","answer1":"Cameroun","answer2":"Azerbaïdjan","answer3":"Burundi","comment":"Le rouge symbolise le sang du peuple durant décolonisation. L'étoile jaune est « l'étoile de l'unité ». Le vert représente la forêt du Cameroun. Le jaune représente le soleil et la savane du pays."},{"image":"canada.png","answer1":"Canada","answer2":"Ouganda","answer3":"Burkina Faso","comment":"La feuille d'érable a servi de symbole célébrant la nature et l'environnement de ce qui est aujourd'hui le Canada depuis le XVIIIe siècle."},{"image":"chili.png","answer1":"Chili","answer2":"Éthiopie","answer3":"France","comment":"Le rouge représente le sang des patriotes ayant lutté pendant l'indépendance, le blanc représente la neige des Andes, le bleu représente le ciel, l'étoile insiste sur l'unité de la république."},{"image":"chine.png","answer1":"Chine","answer2":"Mexique","answer3":"Papouasie-Nouvelle-Guinée","comment":"Le rouge représente la révolution, les cinq étoiles et leur relation représentent l'unité du peuple chinois sous la direction du Parti communiste chinois."},{"image":"chypre.png","answer1":"Chypre","answer2":"Afghanistan","answer3":"Guinée-Bissau","comment":"Ce drapeau représente la carte de l'île (de couleur cuivre symbolisant les importants minerais de cuivre présents sur l'île) placée au-dessus de deux branches d'olivier (symbole de paix)."},{"image":"colombie.png","answer1":"Colombie","answer2":"Bahamas","answer3":"Malte","comment":"Le jaune représente l'or, le bleu représente les deux océans qui baignent le littoral du pays et le rouge symbolise le sang qui a coulé pour la libération du pays."},{"image":"coreedunord.png","answer1":"Corée du Nord","answer2":"Botswana","answer3":"Saint-Vincent-et-les-Grenadines","comment":"Il est constitué de bandes bleues et rouges, symbolisant respectivement la paix et le socialisme. L'étoile rouge (représentant le socialisme) représente l'univers, le yīn et le yáng."},{"image":"coreedusud.png","answer1":"Corée du Sud","answer2":"Russie","answer3":"Namibie","comment":"Les quatre trigrammes du Livre des Mutations représentant les quatre éléments : la terre, le ciel, le feu et l'eau. Ajouté au yin/yan, ce drapeau symbolise l'harmonie universelle."},{"image":"cotedivoire.png","answer1":"Côte d'Ivoire","answer2":"Palaos","answer3":"Chine","comment":"La couleur orange symbolise les savanes du Nord du pays, la couleur blanche, représente la paix et la couleur verte symbolise à la fois l'espoir et les forêts du Sud du pays."},{"image":"croatie.png","answer1":"Croatie","answer2":"Colombie","answer3":"Somalie","comment":"Le blason est échiqueté de gueules et d'argent. Il est surmonté, de senestre à dextre (de gauche à droite), de cinq petits écus qui représentent les régions constitutives du pays."},{"image":"cuba.png","answer1":"Cuba","answer2":"Honduras","answer3":"République démocratique du Congo","comment":"L'étoile blanche se nomme La Estrella Solitaria (« l'Étoile solitaire ») et s'identifie à la liberté chèrement acquise, le triangle est la représentation maçonnique de l'égalité."},{"image":"danemark.png","answer1":"Danemark","answer2":"Micronésie","answer3":"Qatar","comment":"Le drapeau du Danemark est aussi nommé Dannebrog (« vêtement rouge » ou « vêtement danois »). Il possède une croix scandinave, aussi intitulée Croix de saint Olaf."},{"image":"egypte.png","answer1":"Égypte","answer2":"Vatican","answer3":"Russie","comment":"Le rouge renvoie au coup d'État militaire en 1952. Le blanc symbolise ce coup d'État, perpétré sans verser de sang. Le noir représente la fin de l'oppression des colons britanniques."},{"image":"espagne.png","answer1":"Espagne","answer2":"Sénégal","answer3":"Éthiopie","comment":"Les armoiries de l'Espagne possèdent des couleurs fréquentes dans l'héraldisme ibérique : or sur rouge est l'emblème traditionnel de la Castille, les pals rouges sur jaune celui des royaumes d'Aragon."},{"image":"etatsunis.png","answer1":"Etats-Unis","answer2":"Mexique","answer3":"Biélorussie","comment":"Les 50 étoiles représentent les États membres de l'Union et les treize bandes représentent les 13 colonies britanniques à l'origine de la création de l'État américain."},{"image":"finlande.png","answer1":"Finlande","answer2":"Tadjikistan","answer3":"Kiribati","comment":"Ce drapeau représente la croix scandinave bleue. Le bleu symbolise les lacs et le ciel tandis que le blanc symbolise la neige et les blanches nuits de l'été finlandais."},{"image":"france.png","answer1":"France","answer2":"Monténégro","answer3":"Bosnie-Herzégovine","comment":"Le bleu est la couleur de la ville de Paris. Le blanc est associé à la monarchie française. Le rouge est la couleur du sang versé pour libérer le peuple."},{"image":"grece.png","answer1":"Grèce","answer2":"Colombie","answer3":"Uruguay","comment":"La croix symbolise la foi chrétienne et la victoire sur l’occupant. Les neuf bandes rappel les neuf syllabes qui constituent la devise grecque (Eleuthería í thánatos), soit «la liberté ou la mort»."},{"image":"hongrie.png","answer1":"Hongrie","answer2":"Samoa","answer3":"Tchad","comment":"Le rouge pour la force et le sang versé pour la patrie, le blanc pour la foi et la liberté, le vert pour l'espérance, la campagne et les pâtures de Hongrie."},{"image":"inde.png","answer1":"Inde","answer2":"Pays-Bas","answer3":"Kazakhstan","comment":"Au centre se trouve un rouet (charkha), symbolisant l'objectif du Mahatma de pousser les Indiens à l'autosuffisance en fabriquant leurs propres tissus."},{"image":"irlande.png","answer1":"Irlande","answer2":"France","answer3":"Bulgarie","comment":"Le vert représente la couleur traditionnelle de l'Irlande gaélique, que l'orange représente la tradition d'Orange, et que le blanc symbolise la paix entre le vert et l'orange."},{"image":"islande.png","answer1":"Islande","answer2":"Namibie","answer3":"Madagascar","comment":"Le rouge représente le feu des volcans d'Islande, le blanc rappelle les champs de neige et la glace de l'île, le bleu représente l'océan environnant."},{"image":"israel.png","answer1":"Israël","answer2":"Biélorussie","answer3":"Oman","comment":"Le drapeau d'Israël possède en son centre, une étoile bleue à six branches (hexagramme), ou étoile de David. L'hexagramme comme symbole juif remonte à l'époque médiévale."},{"image":"italie.png","answer1":"Italie","answer2":"Équateur","answer3":"Philippines","comment":"Le vert pour les collines des Monts Apennins, le blanc pour la neige des Alpes et le rouge pour le sang des martyrs des trois guerres d'Indépendance du xixe siècle."},{"image":"jamaique.png","answer1":"Jamaïque","answer2":"Brunei","answer3":"Seychelles","comment":"Le vert représente l'espoir, la végétation et l'agriculture, le noir reflète les difficultés à surmonter les obstacles et à faire face, le jaune symbolise le soleil doré."},{"image":"japon.png","answer1":"Japon","answer2":"Guyana","answer3":"Liberia","comment":"Le disque rouge représente le soleil. C'est le drapeau civil, le drapeau d'État, le pavillon marchand et le pavillon d'État du Japon. Il est connu sous le nom de Hinomaru."},{"image":"luxembourg.png","answer1":"Luxembourg","answer2":"Jamaïque","answer3":"Bulgarie","comment":"Officiellement le drapeau n'a été adopté qu'en 1972, avec la loi du 23 juin et amendée en 1993 avec celle du 27 juillet."},{"image":"malaisie.png","answer1":"Malaisie","answer2":"Albanie","answer3":"Kiribati","comment":"Les 14 bandes signifient l'égalité de statut dans la fédération des 13 Etats membres et du gouvernement fédéral, le croissant est un symbole traditionnel de l'Islam."},{"image":"maroc.png","answer1":"Maroc","answer2":"Éthiopie","answer3":"Samoa","comment":"Le rouge et le vert sont les couleurs traditionnelles de drapeaux arabes. Le pentacle représente les piliers de l'Islam et cinq signifie le lien entre Dieu et la nation."},{"image":"mexique.png","answer1":"Mexique","answer2":"Égypte","answer3":"Pays-Bas","comment":"Le blason est dérivé d'une légende selon laquelle les Aztèques erraient, à l'origine, à la recherche d'un lieu où s'établir et qui serait signalé par un aigle sur un cactus en train de manger un serpent."},{"image":"monaco.png","answer1":"Monaco","answer2":"Bahreïn","answer3":"Saint-Vincent-et-les-Grenadines","comment":"Ces couleurs sont celles des Grimaldi, la maison régnante, et ont été en usage depuis 1339, ce qui fait de ce drapeau l'un des plus anciens du monde."},{"image":"norvege.png","answer1":"Norvège","answer2":"Angola","answer3":"Nouvelle-Zélande","comment":"Les couleurs rappellent les dernières unions politiques de la Norvège avec le Danemark (rouge et blanc) et avec la Suède (bleu)."},{"image":"nouvellezelande.png","answer1":"Nouvelle-Zélande","answer2":"Djibouti","answer3":"Etats-Unis","comment":"Les étoiles représentent la constellation de la Croix du Sud dont seulement quatre étoiles sur cinq sont visibles sur le drapeau de la Nouvelle-Zélande."},{"image":"pakistan.png","answer1":"Pakistan","answer2":"Monaco","answer3":"Bosnie-Herzégovine","comment":"Le croissant, l'étoile et la couleur verte sont des symboles traditionnels de l'Islam."},{"image":"paysbas.png","answer1":"Pays-Bas","answer2":"Kenya","answer3":"Gambie","comment":"A l'origine de la bande supérieure était orange, le rouge a finalement été adopté comme couleur permanente, la bannière est la plus ancienne bannière tricolore à avoir eu une utilisation continue."},{"image":"perou.png","answer1":"Pérou","answer2":"Allemagne","answer3":"Bhoutan","comment":"Le blason comporte un écu où sont figurés une vigogne (représentant la faune), un arbre de quinquina (la flore) et une corne d'abondance déversant des pièces jaunes (la richesse minérale)."},{"image":"pologne.png","answer1":"Pologne","answer2":"Italie","answer3":"Bolivie","comment":"Ces deux couleurs sont définies dans la Constitution polonaise comme les couleurs nationales. Deux versions du drapeau existent, avec ou sans les armoiries de la Pologne."},{"image":"portugal.png","answer1":"Portugal","answer2":"Chypre","answer3":"Kirghizistan","comment":"Le vert et le rouge symbolisent l'espoir et le sang de ceux qui défendent la nation. Le blason national est une sphère armillaire comportant l'écu portugais."},{"image":"roumanie.png","answer1":"Roumanie","answer2":"Saint-Vincent-et-les-Grenadines","answer3":"Dominique","comment":"Les couleurs sont celles de la Valachie et de la Moldavie, qui ont été réunie en 1862 pour former la Roumanie, le blason national qui était au centre de la bande jaune a été retiré."},{"image":"royaumeuni.png","answer1":"Royaume-Uni","answer2":"Burundi","answer3":"Pérou","comment":"La croix en fond est celle du patron de l'Irlande rouge. L'autre croix superposée est celle du patron de l'Ecosse blanche. Ce drapeau est connu sous le nom de Union Jack."},{"image":"russie.png","answer1":"Russie","answer2":"Belize","answer3":"Zimbabwe","comment":"Symboliquement les trois bandes sont interprétées comme le tsar (blanc), le ciel (bleu) et le peuple (rouge)."},{"image":"senegal.png","answer1":"Sénégal","answer2":"Cuba","answer3":"Mexique","comment":"Le vert représente l'Islam et l'espoir, le jaune signifie la richesse naturelle et le progrès, le rouge symbolise le sacrifice et la détermination, l'étoile signifie l'unité et l'espoir."},{"image":"serbie.png","answer1":"Serbie","answer2":"Zambie","answer3":"Kazakhstan","comment":"Le petit bouclier rouge est divisé en quatre quarts par une croix blanche : un « C » cyrillique dans chaque canton renvoie à la phrase « l'unité seule sauve les Serbes »."},{"image":"singapour.png","answer1":"Singapour","answer2":"Bhoutan","answer3":"Brésil","comment":"Le croissant de lune symbolise une jeune nation sur la pente ascendante. Les cinq étoiles représentent les idéaux de la nation : la démocratie, la paix, le progrès, la justice et l'égalité."},{"image":"suisse.png","answer1":"Suisse","answer2":"Vanuatu","answer3":"Hongrie","comment":"La croix blanche utilisée comme signe de reconnaissance des troupes de la Confédération suisse est attestée dès la bataille de Laupen (1339)."},{"image":"tunisie.png","answer1":"Tunisie","answer2":"Liechtenstein","answer3":"Israël","comment":"Le rouge représente le sang versé par les martyrs dans la lutte contre l'oppression. Le blanc représente la paix. Le croissant et l'étoile sont des symboles traditionnels de l'Islam."},{"image":"turquie.png","answer1":"Turquie","answer2":"Guinée-Bissau","answer3":"Islande","comment":"Selon la légende, le drapeau représente le reflet de la lune et d'une étoile dans une mare de sang de guerriers turcs."},{"image":"uruguay.png","answer1":"Uruguay","answer2":"Samoa","answer3":"Bhoutan","comment":"Les bandes représentent les neuf départements d'origine de l'Uruguay. Le symbole du soleil évoque la légende de l'apparition soudaine du soleil à travers les nuages le 25 mai 1810."}]